# Taps
tap 'romkatv/gitstatus'

# Core utilities
# TODO: install other azure CLIs too? put this in repo-specific `script/bootstrap`?
brew 'azcopy'
brew 'bat'
brew 'fd'
brew 'htop'
brew 'jq'
brew 'k9s'
# TODO: force this to overwrite link because docker also installs `kubectl`
brew 'kubernetes-cli'
brew 'mysql-client@5.7'
brew 'pstree'
brew 'ripgrep'
brew 'romkatv/gitstatus/gitstatus'
brew 'stow'
brew 'terraform'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'watch'
brew 'z'

# Languages
brew 'shellcheck'

# Fonts
brew 'freetype'
